using UnityEngine;
using UnityEngine.SceneManagement;

public class SceneMoveScript : MonoBehaviour
{
    //=======================================================================================================================
    void Start()
    {
        
    }

    //=======================================================================================================================
    void Update()
    {
        
    }

    //=======================================================================================================================
    // タイトルシーンへ
    public void LoadTitleScene()
    {
        SceneManager.LoadScene("TitleScene");
    }

    //=======================================================================================================================
    // ルールシーンへ
    public void LoadRuleScene()
    {
        SceneManager.LoadScene("RuleScene");
    }

    //=======================================================================================================================
    // 先攻決めシーンへ
    public void LoadDecidingFirstScene()
    {
        SceneManager.LoadScene("DecidingFirstScene");
    }

    //=======================================================================================================================
    // ゲームシーンへ
    public void LoadGameScene()
    {
        SceneManager.LoadScene("GameScene");
    }

    //=======================================================================================================================
    // リザルトシーンへ
    //public void LoadResultScene()
    //{
    //    SceneManager.LoadScene("ResultScene");
    //}
}
